In [62]:
import pandas as pd
import numpy as np
from scipy.stats import ttest_1samp, ttest_ind
import math
from statsmodels.stats.power import ttest_power

In [69]:
# IMPORTING DATA FROM THE EXCEL FILE.

excel_file = 'titan.xlsx'
dataset = pd.read_excel(excel_file,index_col=0)
dataset

              OLD_SCHEME(in thousands)  NEW_SCHEME(in thousands)
SALES_PERSON
1                                   57                        62
2                                  103                       122
3                                   59                        54
4                                   75                        82
5                                   84                        84
6                                   73                        86
7                                   35                        32
8                                  110                       104
9                                   44                        38
10                                  82                       107
11                                  67                        84
12                                  64                        85
13                                  78                        99
14                                  53                        39
15                                  41                        34
16                                  39                        58
17                                  80                        73
18                                  87                        53
19                                  73                        66
20                                  65                        78
21                                  28                        41
22                                  62                        71
23                                  49                        38
24                                  84                        95
25                                  63                        81
26                                  77                        58
27                                  67                        75
28                                 101                        94
29                                  91                       100
30                                  50                        68

In [65]:
# TO FIND THE FIRST FIVE ROWS OF A DATAFRAME. 

dataset.head()

              OLD_SCHEME  NEW_SCHEME
SALES_PERSON
1                     57          62
2                    103         122
3                     59          54
4                     75          82
5                     84          84

In [66]:
dataset.dtypes

OLD_SCHEME    int64
NEW_SCHEME    int64
dtype: object

In [67]:
# TO FIND THE MEAN OF OLD_SCHEME.

dataset.loc[:,'OLD_SCHEME'].mean()

68.03333333333333

In [68]:
# TO FIND THE MEAN OF NEW_SCHEME.

dataset.loc[:,'NEW_SCHEME'].mean()

72.03333333333333

# NULL HYPOTHESIS : There is no difference between the outputs of new & old schemes

# ALTERNATIVE HYPOTHESIS : There is a difference between the outputs of new & old schemes

In [70]:
Olddf = dataset['OLD_SCHEME(in thousands)']
Newdf = dataset['NEW_SCHEME(in thousands)']

In [73]:
ttest = ttest_ind(Olddf, Newdf, axis=0, equal_var=False)
ttest

Ttest_indResult(statistic=-0.6937067608923764, pvalue=0.4907066557404972)

 p>0.05  Hence null hypothesis is accepted. There is no difference between the outputs of new and old scheme.

In [75]:
from scipy.stats import ttest_rel
two_sample=ttest_rel(Olddf,Newdf)
two_sample

Ttest_relResult(statistic=-1.5559143823544377, pvalue=0.13057553961337662)

 Null Hypothesis : The average output has not increased by £5000 in the scheme compared to the old scheme, or mean difference is less than equal to 5000

Alternate Hypothesis : The average output has increased by £5000 in the scheme compared to the old scheme, or mean difference is greater than 5000

In [78]:
dataset['diff']=dataset['NEW_SCHEME(in thousands)']-dataset['OLD_SCHEME(in thousands)']
from scipy.stats import ttest_1samp
one_sample = ttest_1samp(dataset['diff'], 5)
one_sample

Ttest_1sampResult(statistic=-0.3889785955886094, pvalue=0.7001334912613286)

 p>0.05. Null hypothesis is accepted.
The average output has not increased by £5000 in the new scheme compared to the old scheme

In [79]:
TypeIError=1-0.14
print("The probability of making TypeIError is",TypeIError)

The probability of making TypeIError is 0.86

In [80]:
effect=dataset['diff'].mean()/dataset['diff'].std()
Result =ttest_power(effect, nobs=30, alpha=0.86)
print("the power of the test is",Result)

the power of the test is 0.9577194244960947